import { Post } from '@/types/posts';

export const dummyPosts: Post[] = [
  {
    id: 1,
    date: '24.01.2024',
    img: '/images/posts_main/posts-1.jpg',
    link: 'https://www.google.com.ua/?hl=uk',
    heading: 'Як створити ідеальне резюме',
    text: 'Ефективне і якісне резюме — ваш провідник у світ професійного розвитку. І саме час з ним потоваришувати. Відсутність структури, помилки в оформленні і фрази-кліше забирають на себе дорогоцінні секунди і позбавляють шансу перейти до наступного етапу — співбесіди. Ми зібрали інструкції',
  },
  {
    id: 2,
    date: '24.01.2024',
    img: '/images/posts_main/posts-2.jpg',
    link: 'https://www.google.com.ua/?hl=uk',
    heading:
      '7 порад для привабливої самопрезентації на співбесіді',
    text: 'Вдала самопрезентація допоможе вам виділитися з-поміж інших, справити вигідне перше враження та «продати» себе як ідеального кандидата, що принесе максимум користі бізнесу. Якщо ваше резюме зацікавило роботодавця, наступний зростати кількісно. Їм потрібні айтівці, аби',
  },
  {
    id: 3,
    date: '24.01.2024',
    img: '/images/posts_main/posts-3.jpg',
    link: 'https://www.google.com.ua/?hl=uk',
    heading: 'Чому на IT-ринку стало багато джунів',
    text: 'Українська IT-індустрія — одна з небагатьох галузей економіки, яка здатна працювати практично на довоєнному рівні. Попри труднощі зі збереженням і пошуком нових замовників, IT-компанії продовжують зростати кількісно. Їм потрібні айтівці, аби зростати кількісно. Їм потрібні айтівці, аби',
  },
];
