import { Candidates } from '@/types/candidates';

export const candidates: Candidates[] = [
  {
    id: 1,
    text: 'Дотримуються правил в користуванні спільними інструментами',
  },
  {
    id: 2,
    text: 'Дотримуються дед-лайнів',
  },
  {
    id: 3,
    text: 'Дотримуються обов`язку складання документації',
  },
  {
    id: 4,
    text: 'Займають аргументовані позиції в суперечках і конфліктних ситуаціях, результативність, бажання досягти спільної мети',
  },
  {
    id: 5,
    text: 'Готові ділитись інформацією',
  },
  {
    id: 6,
    text: 'Виказують позицію підтримки колег в команді, готовність замінити колегу у випадку форс-мажору',
  },
  {
    id: 7,
    text: 'Цікаві до нового',
  },
  {
    id: 8,
    text: 'Схильні до активності',
  },
  {
    id: 9,
    text: 'Безумовно дотримуються законодавства, зокрема в питаннях авторського права, захисту персональних даних, GDPR, NDA',
  },
  {
    id: 10,
    text: 'Безумовно дотримуються законодавства, зокрема в питаннях авторського права, захисту персональних даних, GDPR, NDA',
  },
];
